<template>
    <div class="container m-auto">
       <h1 class="text-2xl">みちひき</h1>
         <p class="text-2xl">{{ yearMonth }}</p>

       <div class="m-10">
          <!-- 都道府県を表示 -->
            <ul>
               <li v-for="(item, index) in prefectures" :key="item" @click="pcName(index)">
                  {{ item }}
               </li>
            </ul>
       </div>

       <div v-if="isShow"  class="m-10">
          <!-- 選択した都道府県に一致した港を表示 -->
            <ul>
               <li v-for="(portName, index2) in choicePorts" :key="portName" @click="pchcParames(index2)">
                  {{ portName }}
               </li>
            </ul>
       </div>


       <button @click="asyncData()" class="p-3 bg-red-500 text-white">click!</button>
    </div>
</template>
 
<script>
   // 時間取得
   let date = new Date();

   // JSON代入用
   let tideDatas = [];

   // APIパラメータ
   let pc = '';  // 都道府県番号
   let hc = ''; // 港番号
   let yr = ''; // 年
   let mn = ''; // 月
   let dy = ''; // 日
   let rg = 'rg=day'; // 取得期間

   let num = 0; // port取得用管理変数

export default {
   data() {
      return {
         isShow: false,
         
         prefectures: [
            '千島列島', // 0
            '北海道', // 1
            '青森県', // 2
            '岩手県', // 3
            '宮城県', // 4
            '秋田県', // 5
            '山形県', // 6
            '福島県', // 7
            '茨城県', // 8
            '千葉県', // 9
            '東京都', // 10
            '神奈川県', // 11
            '新潟県', // 12
            '富山県', // 13
            '石川県', // 14
            '福井県', // 15
            '静岡県', // 16
            '愛知県', // 17
            '三重県', // 18
            '京都府', // 19
            '大阪府', // 20
            '兵庫県', // 21
            '和歌山県', // 21
            '鳥取県', // 22
            '島根県', // 23
            '岡山県', // 24
            '広島県', // 25
            '山口県', // 26
            '徳島県', // 27
            '香川県', // 28
            '愛媛県', // 29
            '高知県', // 30
            '福岡県', // 31
            '佐賀県', // 32
            '長崎県', // 33
            '熊本県', // 35
            '大分県', // 36
            '宮崎県', // 37
            '鹿児島県', // 38
            '沖縄県', // 39
         ],

         hcNames: [
                     {
                        name: '千島列島',
                        data: [
                           ['pc=0', 'hc=1', '千島列島', '小泊'],
                           ['pc=0', 'hc=2', '千島列島', '中川湾'],
                           ['pc=0', 'hc=3', '千島列島', '片岡湾'],
                           ['pc=0', 'hc=4', '千島列島', '阿頼度島'],
                           ['pc=0', 'hc=5', '千島列島', '磐城埼'],
                           ['pc=0', 'hc=6', '千島列島', '加熊別湾'],
                           ['pc=0', 'hc=7', '千島列島', '鯨湾'],
                           ['pc=0', 'hc=8', '千島列島', '四岩'],
                           ['pc=0', 'hc=9', '千島列島', '乙前湾'],
                           ['pc=0', 'hc=10', '千島列島', '樺里埼'],
                           ['pc=0', 'hc=11', '千島列島', '潮見浦'],
                           ['pc=0', 'hc=12', '千島列島', '黒石湾'],
                           ['pc=0', 'hc=13', '千島列島', '春牟古丹島'],
                           ['pc=0', 'hc=14', '千島列島', '乙女湾'],
                           ['pc=0', 'hc=15', '千島列島', '東浦'],
                           ['pc=0', 'hc=16', '千島列島', '松輪島'],
                           ['pc=0', 'hc=17', '千島列島', '宇志知島'],
                           ['pc=0', 'hc=18', '千島列島', '武魯頓湾'],
                           ['pc=0', 'hc=19', '千島列島', '新知湾'],
                           ['pc=0', 'hc=20', '千島列島', '沙湾'],
                           ['pc=0', 'hc=21', '千島列島', '鐘湾'],
                           ['pc=0', 'hc=22', '千島列島', '床丹島'],
                           ['pc=0', 'hc=23', '千島列島', '吉野浜'],
                           ['pc=0', 'hc=24', '千島列島', '伽藍埼'],
                        ]
                     },
                     {
                        name: '北海道',
                        data: [
                           ['pc=1', 'hc=1', '北海道', '蘂取'],
                           ['pc=1', 'hc=2', '北海道', '紗万部'],
                           ['pc=1', 'hc=3', '北海道', '内岡'],
                           ['pc=1', 'hc=4', '北海道', '内保湾'],
                           ['pc=1', 'hc=5', '北海道', '茂世路湾'],
                           ['pc=1', 'hc=6', '北海道', '単冠湾'],
                           ['pc=1', 'hc=7', '北海道', '入里節'],
                           ['pc=1', 'hc=8', '北海道', 'ニキシヨロ'],
                           ['pc=1', 'hc=9', '北海道', '古釜府湾'],
                           ['pc=1', 'hc=10', '北海道', '泊湾'],
                           ['pc=1', 'hc=11', '北海道', '水晶島'],
                           ['pc=1', 'hc=12', '北海道', '多楽島'],
                           ['pc=1', 'hc=13', '北海道', '斜古丹'],
                           ['pc=1', 'hc=14', '北海道', '根室'],
                           ['pc=1', 'hc=15', '北海道', '尾岱沼'],
                           ['pc=1', 'hc=16', '北海道', '羅臼'],
                           ['pc=1', 'hc=17', '北海道', 'コイセボイ'],
                           ['pc=1', 'hc=18', '北海道', '網走'],
                           ['pc=1', 'hc=19', '北海道', '紋別'],
                           ['pc=1', 'hc=20', '北海道', '雄武'],
                           ['pc=1', 'hc=21', '北海道', '枝幸'],
                           ['pc=1', 'hc=22', '北海道', '浜鬼志別'],
                           ['pc=1', 'hc=23', '北海道', '宗谷岬'],
                           ['pc=1', 'hc=24', '北海道', '稚内'],
                           ['pc=1', 'hc=25', '北海道', '抜海'],
                           ['pc=1', 'hc=26', '北海道', '鴛泊'],
                           ['pc=1', 'hc=27', '北海道', '沓形'],
                           ['pc=1', 'hc=28', '北海道', '船泊'],
                           ['pc=1', 'hc=29', '北海道', '苫前'],
                           ['pc=1', 'hc=30', '北海道', '留萌'],
                           ['pc=1', 'hc=31', '北海道', '浜益'],
                           ['pc=1', 'hc=32', '北海道', '小樽'],
                           ['pc=1', 'hc=33', '北海道', '忍路'],
                           ['pc=1', 'hc=34', '北海道', '神威岬'],
                           ['pc=1', 'hc=35', '北海道', '岩内'],
                           ['pc=1', 'hc=36', '北海道', '寿都'],
                           ['pc=1', 'hc=37', '北海道', '瀬棚'],
                           ['pc=1', 'hc=38', '北海道', '奥尻'],
                           ['pc=1', 'hc=39', '北海道', '青苗'],
                           ['pc=1', 'hc=40', '北海道', '江差'],
                           ['pc=1', 'hc=41', '北海道', '清部'],
                           ['pc=1', 'hc=42', '北海道', '松前'],
                           ['pc=1', 'hc=43', '北海道', '吉岡'],
                           ['pc=1', 'hc=44', '北海道', '湧元'],
                           ['pc=1', 'hc=45', '北海道', '函館'],
                           ['pc=1', 'hc=46', '北海道', '汐首岬'],
                           ['pc=1', 'hc=47', '北海道', '戸井'],
                           ['pc=1', 'hc=48', '北海道', '古武井'],
                           ['pc=1', 'hc=49', '北海道', '臼尻'],
                           ['pc=1', 'hc=50', '北海道', '森'],
                           ['pc=1', 'hc=51', '北海道', '有珠湾'],
                           ['pc=1', 'hc=52', '北海道', '室蘭'],
                           ['pc=1', 'hc=53', '北海道', '苫小牧'],
                           ['pc=1', 'hc=54', '北海道', '東静内'],
                           ['pc=1', 'hc=55', '北海道', '三石'],
                           ['pc=1', 'hc=56', '北海道', '浦河'],
                           ['pc=1', 'hc=57', '北海道', 'えりも'],
                           ['pc=1', 'hc=58', '北海道', '歌露'],
                           ['pc=1', 'hc=59', '北海道', '襟裳岬'],
                           ['pc=1', 'hc=60', '北海道', '庶野'],
                           ['pc=1', 'hc=61', '北海道', 'ルベシベツ'],
                           ['pc=1', 'hc=62', '北海道', '音調津'],
                           ['pc=1', 'hc=63', '北海道', '十勝'],
                           ['pc=1', 'hc=64', '北海道', '釧路'],
                           ['pc=1', 'hc=65', '北海道', '厚岸'],
                           ['pc=1', 'hc=66', '北海道', '厚岸湖'],
                           ['pc=1', 'hc=67', '北海道', '霧多布'],
                           ['pc=1', 'hc=68', '北海道', '落石'],
                           ['pc=1', 'hc=69', '北海道', '花咲'],
                           ['pc=1', 'hc=70', '北海道', '香深'],
                           ['pc=1', 'hc=71', '北海道', '常呂'],
                           ['pc=1', 'hc=72', '北海道', '湧別'],
                           ['pc=1', 'hc=73', '北海道', '利尻'],
                        ]
                     },
                     {
                        name: '青森県',
                        data: [
                        ['pc=2', 'hc=1', '青森県', '竜飛埼'],
                        ['pc=2', 'hc=2', '青森県', '三厩'],
                        ['pc=2', 'hc=3', '青森県', '袰月'],
                        ['pc=2', 'hc=4', '青森県', '青森'],
                        ['pc=2', 'hc=5', '青森県', '茂浦'],
                        ['pc=2', 'hc=6', '青森県', '小湊'],
                        ['pc=2', 'hc=7', '青森県', '野辺地'],
                        ['pc=2', 'hc=8', '青森県', '大湊'],
                        ['pc=2', 'hc=9', '青森県', '大間'],
                        ['pc=2', 'hc=10', '青森県', '大畑'],
                        ['pc=2', 'hc=11', '青森県', '尻屋岬'],
                        ['pc=2', 'hc=12', '青森県', '尻屋'],
                        ['pc=2', 'hc=13', '青森県', '白糠'],
                        ['pc=2', 'hc=14', '青森県', '泊'],
                        ['pc=2', 'hc=15', '青森県', '八戸'],
                        ['pc=2', 'hc=16', '青森県', '岩崎'],
                        ['pc=2', 'hc=17', '青森県', '深浦'],
                        ['pc=2', 'hc=18', '青森県', '鯵ヶ沢'],
                        ['pc=2', 'hc=19', '青森県', '小泊'],
                        ['pc=2', 'hc=20', '青森県', '関根浜'],
                        ['pc=2', 'hc=21', '青森県', '浅虫'],
                        ['pc=2', 'hc=22', '青森県', '竜飛'],    
                        ]
                     },
            ],
            choicePorts: [],
         }
   },

   computed:{
      // テンプレートで使う現在時刻を代入
      yearMonth:function(){
         this.year = date.getFullYear();
         this.month = date.getMonth() + 1;
         this.actualDay = date.getDate();
         let yearMonth = this.year + '年' +  this.month + '月';
         return yearMonth;
      },
   },

   methods: {
      //都道府県選択からの漁港表示まで
      pcName:function(index){
         if(num == 0){
            for(let i = 0; i < this.hcNames[index].data.length; i++){
               this.choicePorts.push(this.hcNames[index].data[i][3]);
            }
            num++;
            this.isShow = true;
            this.index = index;
            return this.choicePorts, num, index;
         }
      },

      //PCとHCのparameterを代入
      pchcParames:function(index2){
         console.log(this.index);
         console.log(index2);
      },

      // パラメータに現在日時を入力してAPI取得
      async asyncData() {
         this.year = date.getFullYear();
         this.month = date.getMonth() + 1;
         this.actualDay = date.getDate();
         yr = 'yr=' + this.year;
         mn = 'mn=' + this.month;
         dy = 'dy=' + this.actualDay;
         let items = await this.$axios.$get('/api/' + '?' + pc + '&' + hc + '&'+ yr + '&' + mn + '&' + dy + '&' + rg);
         console.log(items);
         this.tideDatas = items;
         return {
            tideDatas: items,
         }
      },
   },

   

   

   mounted() {

   },
   
}
</script>

<style>

</style>

// https://zenn.dev/mouse_484/artizcles/nuxt-axios-cors

// https://zenn.dev/code_diver/articles/dcf0ec9803cb55

