<template>
    <div class="container m-auto">
       <h1 class="text-2xl">みちひき</h1>
         <p class="text-2xl">{{ yearMonth }}</p>

       <div class="m-10">
          <!-- 都道府県を表示 -->
            <ul>
               <li v-for="(prefecture, index) in prefectures" :key="prefecture" @click="pcName(prefecture, index)">
                  {{ prefecture }}
               </li>
            </ul>
       </div>

       <div v-if="isShow"  class="m-10">
          <!-- 選択した都道府県に一致した港を表示 -->
            <ul>
               <li v-for="(portName, index2) in choicePorts" :key="portName" @click="pchcParames(portName, index2)">
                  {{ portName }}
               </li>
            </ul>
            <br><br>
            <p>都道府県：{{ choicePc }}</p>
            <p>場所：{{ choicePort }}</p>
       </div>


       <button @click="asyncData()" class="p-3 bg-red-500 text-white">click!</button>
    </div>
</template>
 
<script>
   // 時間取得
   let date = new Date();

   // JSON代入用
   let tideDatas = [];

   // APIパラメータ
   let pc = '';  // 都道府県番号
   let hc = ''; // 港番号
   let yr = ''; // 年
   let mn = ''; // 月
   let dy = ''; // 日
   let rg = 'rg=day'; // 取得期間

   let num = 0; // port取得用管理変数

export default {
   data() {
      return {
         isShow: false,
         
         prefectures: [
            '千島列島', // 0
            '北海道', // 1
            '青森県', // 2
            '岩手県', // 3
            '宮城県', // 4
            '秋田県', // 5
            '山形県', // 6
            '福島県', // 7
            '茨城県', // 8
            '千葉県', // 9
            '東京都', // 10
            '神奈川県', // 11
            '新潟県', // 12
            '富山県', // 13
            '石川県', // 14
            '福井県', // 15
            '静岡県', // 16
            '愛知県', // 17
            '三重県', // 18
            '京都府', // 19
            '大阪府', // 20
            '兵庫県', // 21
            '和歌山県', // 21
            '鳥取県', // 22
            '島根県', // 23
            '岡山県', // 24
            '広島県', // 25
            '山口県', // 26
            '徳島県', // 27
            '香川県', // 28
            '愛媛県', // 29
            '高知県', // 30
            '福岡県', // 31
            '佐賀県', // 32
            '長崎県', // 33
            '熊本県', // 35
            '大分県', // 36
            '宮崎県', // 37
            '鹿児島県', // 38
            '沖縄県', // 39
         ],

         hcNames: [
                     {
                        name: '千島列島',
                        data: [
                           ['pc=0', 'hc=1', '千島列島', '小泊'],
                           ['pc=0', 'hc=2', '千島列島', '中川湾'],
                           ['pc=0', 'hc=3', '千島列島', '片岡湾'],
                           ['pc=0', 'hc=4', '千島列島', '阿頼度島'],
                           ['pc=0', 'hc=5', '千島列島', '磐城埼'],
                           ['pc=0', 'hc=6', '千島列島', '加熊別湾'],
                           ['pc=0', 'hc=7', '千島列島', '鯨湾'],
                           ['pc=0', 'hc=8', '千島列島', '四岩'],
                           ['pc=0', 'hc=9', '千島列島', '乙前湾'],
                           ['pc=0', 'hc=10', '千島列島', '樺里埼'],
                           ['pc=0', 'hc=11', '千島列島', '潮見浦'],
                           ['pc=0', 'hc=12', '千島列島', '黒石湾'],
                           ['pc=0', 'hc=13', '千島列島', '春牟古丹島'],
                           ['pc=0', 'hc=14', '千島列島', '乙女湾'],
                           ['pc=0', 'hc=15', '千島列島', '東浦'],
                           ['pc=0', 'hc=16', '千島列島', '松輪島'],
                           ['pc=0', 'hc=17', '千島列島', '宇志知島'],
                           ['pc=0', 'hc=18', '千島列島', '武魯頓湾'],
                           ['pc=0', 'hc=19', '千島列島', '新知湾'],
                           ['pc=0', 'hc=20', '千島列島', '沙湾'],
                           ['pc=0', 'hc=21', '千島列島', '鐘湾'],
                           ['pc=0', 'hc=22', '千島列島', '床丹島'],
                           ['pc=0', 'hc=23', '千島列島', '吉野浜'],
                           ['pc=0', 'hc=24', '千島列島', '伽藍埼'],
                        ]
                     },
                     {
                        name: '北海道',
                        data: [
                           ['pc=1', 'hc=1', '北海道', '蘂取'],
                           ['pc=1', 'hc=2', '北海道', '紗万部'],
                           ['pc=1', 'hc=3', '北海道', '内岡'],
                           ['pc=1', 'hc=4', '北海道', '内保湾'],
                           ['pc=1', 'hc=5', '北海道', '茂世路湾'],
                           ['pc=1', 'hc=6', '北海道', '単冠湾'],
                           ['pc=1', 'hc=7', '北海道', '入里節'],
                           ['pc=1', 'hc=8', '北海道', 'ニキシヨロ'],
                           ['pc=1', 'hc=9', '北海道', '古釜府湾'],
                           ['pc=1', 'hc=10', '北海道', '泊湾'],
                           ['pc=1', 'hc=11', '北海道', '水晶島'],
                           ['pc=1', 'hc=12', '北海道', '多楽島'],
                           ['pc=1', 'hc=13', '北海道', '斜古丹'],
                           ['pc=1', 'hc=14', '北海道', '根室'],
                           ['pc=1', 'hc=15', '北海道', '尾岱沼'],
                           ['pc=1', 'hc=16', '北海道', '羅臼'],
                           ['pc=1', 'hc=17', '北海道', 'コイセボイ'],
                           ['pc=1', 'hc=18', '北海道', '網走'],
                           ['pc=1', 'hc=19', '北海道', '紋別'],
                           ['pc=1', 'hc=20', '北海道', '雄武'],
                           ['pc=1', 'hc=21', '北海道', '枝幸'],
                           ['pc=1', 'hc=22', '北海道', '浜鬼志別'],
                           ['pc=1', 'hc=23', '北海道', '宗谷岬'],
                           ['pc=1', 'hc=24', '北海道', '稚内'],
                           ['pc=1', 'hc=25', '北海道', '抜海'],
                           ['pc=1', 'hc=26', '北海道', '鴛泊'],
                           ['pc=1', 'hc=27', '北海道', '沓形'],
                           ['pc=1', 'hc=28', '北海道', '船泊'],
                           ['pc=1', 'hc=29', '北海道', '苫前'],
                           ['pc=1', 'hc=30', '北海道', '留萌'],
                           ['pc=1', 'hc=31', '北海道', '浜益'],
                           ['pc=1', 'hc=32', '北海道', '小樽'],
                           ['pc=1', 'hc=33', '北海道', '忍路'],
                           ['pc=1', 'hc=34', '北海道', '神威岬'],
                           ['pc=1', 'hc=35', '北海道', '岩内'],
                           ['pc=1', 'hc=36', '北海道', '寿都'],
                           ['pc=1', 'hc=37', '北海道', '瀬棚'],
                           ['pc=1', 'hc=38', '北海道', '奥尻'],
                           ['pc=1', 'hc=39', '北海道', '青苗'],
                           ['pc=1', 'hc=40', '北海道', '江差'],
                           ['pc=1', 'hc=41', '北海道', '清部'],
                           ['pc=1', 'hc=42', '北海道', '松前'],
                           ['pc=1', 'hc=43', '北海道', '吉岡'],
                           ['pc=1', 'hc=44', '北海道', '湧元'],
                           ['pc=1', 'hc=45', '北海道', '函館'],
                           ['pc=1', 'hc=46', '北海道', '汐首岬'],
                           ['pc=1', 'hc=47', '北海道', '戸井'],
                           ['pc=1', 'hc=48', '北海道', '古武井'],
                           ['pc=1', 'hc=49', '北海道', '臼尻'],
                           ['pc=1', 'hc=50', '北海道', '森'],
                           ['pc=1', 'hc=51', '北海道', '有珠湾'],
                           ['pc=1', 'hc=52', '北海道', '室蘭'],
                           ['pc=1', 'hc=53', '北海道', '苫小牧'],
                           ['pc=1', 'hc=54', '北海道', '東静内'],
                           ['pc=1', 'hc=55', '北海道', '三石'],
                           ['pc=1', 'hc=56', '北海道', '浦河'],
                           ['pc=1', 'hc=57', '北海道', 'えりも'],
                           ['pc=1', 'hc=58', '北海道', '歌露'],
                           ['pc=1', 'hc=59', '北海道', '襟裳岬'],
                           ['pc=1', 'hc=60', '北海道', '庶野'],
                           ['pc=1', 'hc=61', '北海道', 'ルベシベツ'],
                           ['pc=1', 'hc=62', '北海道', '音調津'],
                           ['pc=1', 'hc=63', '北海道', '十勝'],
                           ['pc=1', 'hc=64', '北海道', '釧路'],
                           ['pc=1', 'hc=65', '北海道', '厚岸'],
                           ['pc=1', 'hc=66', '北海道', '厚岸湖'],
                           ['pc=1', 'hc=67', '北海道', '霧多布'],
                           ['pc=1', 'hc=68', '北海道', '落石'],
                           ['pc=1', 'hc=69', '北海道', '花咲'],
                           ['pc=1', 'hc=70', '北海道', '香深'],
                           ['pc=1', 'hc=71', '北海道', '常呂'],
                           ['pc=1', 'hc=72', '北海道', '湧別'],
                           ['pc=1', 'hc=73', '北海道', '利尻'],
                        ]
                     },
                     {
                        name: '青森県',
                        data: [
                           ['pc=2', 'hc=1', '青森県', '竜飛埼'],
                           ['pc=2', 'hc=2', '青森県', '三厩'],
                           ['pc=2', 'hc=3', '青森県', '袰月'],
                           ['pc=2', 'hc=4', '青森県', '青森'],
                           ['pc=2', 'hc=5', '青森県', '茂浦'],
                           ['pc=2', 'hc=6', '青森県', '小湊'],
                           ['pc=2', 'hc=7', '青森県', '野辺地'],
                           ['pc=2', 'hc=8', '青森県', '大湊'],
                           ['pc=2', 'hc=9', '青森県', '大間'],
                           ['pc=2', 'hc=10', '青森県', '大畑'],
                           ['pc=2', 'hc=11', '青森県', '尻屋岬'],
                           ['pc=2', 'hc=12', '青森県', '尻屋'],
                           ['pc=2', 'hc=13', '青森県', '白糠'],
                           ['pc=2', 'hc=14', '青森県', '泊'],
                           ['pc=2', 'hc=15', '青森県', '八戸'],
                           ['pc=2', 'hc=16', '青森県', '岩崎'],
                           ['pc=2', 'hc=17', '青森県', '深浦'],
                           ['pc=2', 'hc=18', '青森県', '鯵ヶ沢'],
                           ['pc=2', 'hc=19', '青森県', '小泊'],
                           ['pc=2', 'hc=20', '青森県', '関根浜'],
                           ['pc=2', 'hc=21', '青森県', '浅虫'],
                           ['pc=2', 'hc=22', '青森県', '竜飛'],    
                        ]
                     },
                     {
                        name: '岩手県',
                        data: [
                           ['pc=3', 'hc=1', '岩手県', '久慈'],
                           ['pc=3', 'hc=2', '岩手県', '宮古'],
                           ['pc=3', 'hc=3', '岩手県', '山田'],
                           ['pc=3', 'hc=4', '岩手県', '釜石'],
                           ['pc=3', 'hc=5', '岩手県', '大船渡'],
                           ['pc=3', 'hc=6', '岩手県', '八木'],
                           ['pc=3', 'hc=7', '岩手県', '茂師'],
                        ]
                     },
                     {
                        name: '宮城県',
                        data: [
                           ['pc=4', 'hc=1', '宮城県', '気仙沼'],
                           ['pc=4', 'hc=2', '宮城県', '船越湾'],
                           ['pc=4', 'hc=3', '宮城県', '女川'],
                           ['pc=4', 'hc=4', '宮城県', '鮎川'],
                           ['pc=4', 'hc=5', '宮城県', '荻浜'],
                           ['pc=4', 'hc=6', '宮城県', '石巻'],
                           ['pc=4', 'hc=7', '宮城県', '野蒜湾'],
                           ['pc=4', 'hc=8', '宮城県', '石浜'],
                           ['pc=4', 'hc=9', '宮城県', '港橋'],
                           ['pc=4', 'hc=10', '宮城県', '花淵浜'],
                           ['pc=4', 'hc=11', '宮城県', '仙台'],
                           ['pc=4', 'hc=12', '宮城県', '閖上'],
                           ['pc=4', 'hc=13', '宮城県', '志津川'],
                        ]
                     },
                     {
                        name: '秋田県',
                        data: [
                           ['pc=5', 'hc=1', '秋田県', '金浦'],
                           ['pc=5', 'hc=2', '秋田県', '秋田'],
                           ['pc=5', 'hc=3', '秋田県', '船川'],
                           ['pc=5', 'hc=4', '秋田県', '能代'],
                           ['pc=5', 'hc=5', '秋田県', '岩館'],
                           ['pc=5', 'hc=6', '秋田県', '男鹿'],
                        ]
                     },
                     {
                        name: '山形県',
                        data: [
                           ['pc=6', 'hc=1', '山形県', '鼠ヶ関'],
                           ['pc=6', 'hc=2', '山形県', '由良'],
                           ['pc=6', 'hc=3', '山形県', '加茂'],
                           ['pc=6', 'hc=4', '山形県', '酒田'],
                        ]
                     },
                     {
                        name: '福島県',
                        data: [
                           ['pc=7', 'hc=1', '福島県', '相馬'],
                           ['pc=7', 'hc=2', '福島県', '松川浦'],
                           ['pc=7', 'hc=3', '福島県', '夫沢'],
                           ['pc=7', 'hc=4', '福島県', '富岡'],
                           ['pc=7', 'hc=5', '福島県', '四倉'],
                           ['pc=7', 'hc=6', '福島県', '小名浜'],
                        ]
                     },
                     {
                        name: '茨城県',
                        data: [
                           ['pc=8', 'hc=1', '茨城県', '大津'],
                           ['pc=8', 'hc=2', '茨城県', '日立'],
                           ['pc=8', 'hc=3', '茨城県', '那珂湊'],
                           ['pc=8', 'hc=4', '茨城県', '鹿島'],
                           ['pc=8', 'hc=5', '茨城県', '大洗'],
                        ]
                     },
                     {
                        name: '千葉県',
                        data: [
                           ['pc=12', 'hc=1', '千葉県', '新地'],
                           ['pc=12', 'hc=2', '千葉県', '銚子漁港'],
                           ['pc=12', 'hc=3', '千葉県', '犬吠埼'],
                           ['pc=12', 'hc=4', '千葉県', '名洗'],
                           ['pc=12', 'hc=5', '千葉県', '上総勝浦'],
                           ['pc=12', 'hc=6', '千葉県', '鴨川'],
                           ['pc=12', 'hc=7', '千葉県', '白浜'],
                           ['pc=12', 'hc=8', '千葉県', '布良'],
                           ['pc=12', 'hc=9', '千葉県', '船形'],
                           ['pc=12', 'hc=10', '千葉県', '岩井袋'],
                           ['pc=12', 'hc=11', '千葉県', '第１海堡'],
                           ['pc=12', 'hc=12', '千葉県', '君津'],
                           ['pc=12', 'hc=13', '千葉県', '姉崎'],
                           ['pc=12', 'hc=14', '千葉県', '市原'],
                           ['pc=12', 'hc=15', '千葉県', '寒川'],
                           ['pc=12', 'hc=16', '千葉県', '千葉灯標'],
                           ['pc=12', 'hc=17', '千葉県', '市川'],
                           ['pc=12', 'hc=18', '千葉県', '船橋'],
                           ['pc=12', 'hc=19', '千葉県', '館山'],
                        ]
                     },
                     {
                        name: '東京都',
                        data: [
                           ['pc=13', 'hc=1', '東京都', '築地'],
                           ['pc=13', 'hc=2', '東京都', '芝浦'],
                           ['pc=13', 'hc=3', '東京都', '羽田'],
                           ['pc=13', 'hc=4', '東京都', '岡田'],
                           ['pc=13', 'hc=5', '東京都', '波浮'],
                           ['pc=13', 'hc=6', '東京都', '式根島'],
                           ['pc=13', 'hc=7', '東京都', '神津島'],
                           ['pc=13', 'hc=8', '東京都', '阿古'],
                           ['pc=13', 'hc=9', '東京都', '神湊'],
                           ['pc=13', 'hc=10', '東京都', '鳥島'],
                           ['pc=13', 'hc=11', '東京都', '二見'],
                           ['pc=13', 'hc=12', '東京都', '沖'],
                           ['pc=13', 'hc=13', '東京都', '西'],
                           ['pc=13', 'hc=14', '東京都', '晴海'],
                           ['pc=13', 'hc=15', '東京都', '八重根'],
                           ['pc=13', 'hc=16', '東京都', '沖ノ鳥島'],
                        ]
                     },
                     {
                        name: '神奈川県',
                        data: [
                           ['pc=14', 'hc=1', '神奈川県', '塩浜運河'],
                           ['pc=14', 'hc=2', '神奈川県', '末広'],
                           ['pc=14', 'hc=3', '神奈川県', '新港'],
                           ['pc=14', 'hc=4', '神奈川県', '新山下'],
                           ['pc=14', 'hc=5', '神奈川県', '根岸'],
                           ['pc=14', 'hc=6', '神奈川県', '長浦'],
                           ['pc=14', 'hc=7', '神奈川県', '横須賀'],
                           ['pc=14', 'hc=8', '神奈川県', '走水'],
                           ['pc=14', 'hc=9', '神奈川県', '浦賀'],
                           ['pc=14', 'hc=10', '神奈川県', '久里浜'],
                           ['pc=14', 'hc=11', '神奈川県', '金田湾'],
                           ['pc=14', 'hc=12', '神奈川県', '間口'],
                           ['pc=14', 'hc=13', '神奈川県', '城ヶ島'],
                           ['pc=14', 'hc=14', '神奈川県', '向ヶ崎'],
                           ['pc=14', 'hc=15', '神奈川県', '諸磯'],
                           ['pc=14', 'hc=16', '神奈川県', '油壷'],
                           ['pc=14', 'hc=17', '神奈川県', '小田和湾'],
                           ['pc=14', 'hc=18', '神奈川県', '新宿湾'],
                           ['pc=14', 'hc=19', '神奈川県', '江ノ島'],
                           ['pc=14', 'hc=20', '神奈川県', '真鶴'],
                        ]
                     },
                     {
                        name: '新潟県',
                        data: [
                           ['pc=15', 'hc=1', '新潟県', '能生'],
                           ['pc=15', 'hc=2', '新潟県', '直江津'],
                           ['pc=15', 'hc=3', '新潟県', '柏崎'],
                           ['pc=15', 'hc=4', '新潟県', '出雲崎'],
                           ['pc=15', 'hc=5', '新潟県', '寺泊'],
                           ['pc=15', 'hc=6', '新潟県', '新潟西港'],
                           ['pc=15', 'hc=7', '新潟県', '二見'],
                           ['pc=15', 'hc=8', '新潟県', '小木'],
                           ['pc=15', 'hc=9', '新潟県', '両津'],
                           ['pc=15', 'hc=10', '新潟県', '鷲崎'],
                           ['pc=15', 'hc=11', '新潟県', '岩船'],
                           ['pc=15', 'hc=12', '新潟県', '粟島'],
                           ['pc=15', 'hc=13', '新潟県', '新潟東港'],
                        ]
                     },
                     {
                        name: '富山県',
                        data: [
                           ['pc=16', 'hc=1', '富山県', '阿尾'],
                           ['pc=16', 'hc=2', '富山県', '伏木'],
                           ['pc=16', 'hc=3', '富山県', '富山'],
                           ['pc=16', 'hc=4', '富山県', '生地'],
                           ['pc=16', 'hc=5', '富山県', '宮崎'],
                        ]
                     },
                     {
                        name: '石川県',
                        data: [
                           ['pc=17', 'hc=1', '石川県', '金沢'],
                           ['pc=17', 'hc=2', '石川県', '滝'],
                           ['pc=17', 'hc=3', '石川県', '寺家'],
                           ['pc=17', 'hc=4', '石川県', '輪島'],
                           ['pc=17', 'hc=5', '石川県', '松波'],
                           ['pc=17', 'hc=6', '石川県', '曾良'],
                           ['pc=17', 'hc=7', '石川県', '中居入'],
                           ['pc=17', 'hc=8', '石川県', '七尾'],
                           ['pc=17', 'hc=9', '石川県', '穴水'],
                        ]
                     },
                     {
                        name: '福井県',
                        data: [
                           ['pc=18', 'hc=1', '福井県', '内浦湾'],
                           ['pc=18', 'hc=2', '福井県', '和田'],
                           ['pc=18', 'hc=3', '福井県', '小浜'],
                           ['pc=18', 'hc=4', '福井県', '丹生'],
                           ['pc=18', 'hc=5', '福井県', '敦賀'],
                           ['pc=18', 'hc=6', '福井県', '福井'],
                           ['pc=18', 'hc=7', '福井県', '三国'],
                        ]
                     },
                     {
                        name: '静岡県',
                        data: [
                           ['pc=22', 'hc=1', '静岡県', '網代'],
                           ['pc=22', 'hc=2', '静岡県', '伊東'],
                           ['pc=22', 'hc=3', '静岡県', '川奈'],
                           ['pc=22', 'hc=4', '静岡県', '白浜'],
                           ['pc=22', 'hc=5', '静岡県', '下田'],
                           ['pc=22', 'hc=6', '静岡県', '南伊豆'],
                           ['pc=22', 'hc=7', '静岡県', '妻良子浦'],
                           ['pc=22', 'hc=8', '静岡県', '田子'],
                           ['pc=22', 'hc=9', '静岡県', '宇久須'],
                           ['pc=22', 'hc=10', '静岡県', '三津'],
                           ['pc=22', 'hc=11', '静岡県', '田子の浦'],
                           ['pc=22', 'hc=12', '静岡県', '興津'],
                           ['pc=22', 'hc=13', '静岡県', '清水'],
                           ['pc=22', 'hc=14', '静岡県', '三保'],
                           ['pc=22', 'hc=15', '静岡県', '焼津'],
                           ['pc=22', 'hc=16', '静岡県', '相良'],
                           ['pc=22', 'hc=17', '静岡県', '御前崎'],
                           ['pc=22', 'hc=18', '静岡県', '舞阪'],
                           ['pc=22', 'hc=19', '静岡県', '熱海'],
                        ]
                     },
                     {
                        name: '愛知県',
                        data: [
                           ['pc=23', 'hc=1', '愛知県', '伊良湖'],
                           ['pc=23', 'hc=2', '愛知県', '神島'],
                           ['pc=23', 'hc=3', '愛知県', '篠島'],
                           ['pc=23', 'hc=4', '愛知県', '佐久島'],
                           ['pc=23', 'hc=5', '愛知県', '立馬埼'],
                           ['pc=23', 'hc=6', '愛知県', '福江'],
                           ['pc=23', 'hc=7', '愛知県', '豊橋'],
                           ['pc=23', 'hc=8', '愛知県', '三谷'],
                           ['pc=23', 'hc=9', '愛知県', '蒲郡'],
                           ['pc=23', 'hc=10', '愛知県', '形原'],
                           ['pc=23', 'hc=11', '愛知県', '洲崎'],
                           ['pc=23', 'hc=12', '愛知県', '寺津'],
                           ['pc=23', 'hc=13', '愛知県', '武豊'],
                           ['pc=23', 'hc=14', '愛知県', '師崎'],
                           ['pc=23', 'hc=15', '愛知県', '常滑'],
                           ['pc=23', 'hc=16', '愛知県', '鬼崎'],
                           ['pc=23', 'hc=17', '愛知県', '名古屋'],
                           ['pc=23', 'hc=18', '愛知県', '赤羽根'],
                        ]
                     },
                     {
                        name: '三重県',
                        data: [
                           ['pc=24', 'hc=1', '三重県', '四日市'],
                           ['pc=24', 'hc=2', '三重県', '津'],
                           ['pc=24', 'hc=3', '三重県', '松阪'],
                           ['pc=24', 'hc=4', '三重県', '宇治山田'],
                           ['pc=24', 'hc=5', '三重県', '鳥羽'],
                           ['pc=24', 'hc=6', '三重県', '的矢'],
                           ['pc=24', 'hc=7', '三重県', '浜島'],
                           ['pc=24', 'hc=8', '三重県', '五ヶ所'],
                           ['pc=24', 'hc=9', '三重県', '吉津'],
                           ['pc=24', 'hc=10', '三重県', '長島'],
                           ['pc=24', 'hc=11', '三重県', '尾鷲'],
                           ['pc=24', 'hc=12', '三重県', '古江'],
                           ['pc=24', 'hc=13', '三重県', '二木島'],
                           ['pc=24', 'hc=14', '三重県', '鵜殿'],
                           ['pc=24', 'hc=15', '三重県', '錦'],
                        ]
                     },
                     {
                        name: '京都府',
                        data: [
                           ['pc=26', 'hc=1', '京都府', '伊根'],
                           ['pc=26', 'hc=2', '京都府', '島埼'],
                           ['pc=26', 'hc=3', '京都府', '獅子崎'],
                           ['pc=26', 'hc=4', '京都府', '田井'],
                           ['pc=26', 'hc=5', '京都府', '舞鶴東港'],
                           ['pc=26', 'hc=6', '京都府', '舞鶴西港'],
                        ]
                     },
                     {
                        name: '大阪府',
                        data: [
                           ['pc=27', 'hc=1', '大阪府', '深日'],
                           ['pc=27', 'hc=2', '大阪府', '淡輪'],
                           ['pc=27', 'hc=3', '大阪府', '岸和田'],
                           ['pc=27', 'hc=4', '大阪府', '泉大津'],
                           ['pc=27', 'hc=5', '大阪府', '堺'],
                           ['pc=27', 'hc=6', '大阪府', '大阪'],
                        ]
                     },
                     {
                        name: '兵庫県',
                        data: [
                           ['pc=28', 'hc=1', '兵庫県', '福良'],
                           ['pc=28', 'hc=2', '兵庫県', '阿那賀浦'],
                           ['pc=28', 'hc=3', '兵庫県', '由良'],
                           ['pc=28', 'hc=4', '兵庫県', '洲本'],
                           ['pc=28', 'hc=5', '兵庫県', '仮屋'],
                           ['pc=28', 'hc=6', '兵庫県', '尼崎'],
                           ['pc=28', 'hc=7', '兵庫県', '神戸'],
                           ['pc=28', 'hc=8', '兵庫県', '苅藻島'],
                           ['pc=28', 'hc=9', '兵庫県', '明石'],
                           ['pc=28', 'hc=10', '兵庫県', '岩屋'],
                           ['pc=28', 'hc=11', '兵庫県', '江崎'],
                           ['pc=28', 'hc=12', '兵庫県', '室津'],
                           ['pc=28', 'hc=13', '兵庫県', '江井'],
                           ['pc=28', 'hc=14', '兵庫県', '家島'],
                           ['pc=28', 'hc=15', '兵庫県', '二見'],
                           ['pc=28', 'hc=16', '兵庫県', '高砂'],
                           ['pc=28', 'hc=17', '兵庫県', '飾磨'],
                           ['pc=28', 'hc=18', '兵庫県', '広畑'],
                           ['pc=28', 'hc=19', '兵庫県', '相生'],
                           ['pc=28', 'hc=20', '兵庫県', '赤穂'],
                           ['pc=28', 'hc=21', '兵庫県', '香住'],
                           ['pc=28', 'hc=22', '兵庫県', '柴山'],
                           ['pc=28', 'hc=23', '兵庫県', '津居山'],
                           ['pc=28', 'hc=24', '兵庫県', '垂水'],
                        ]
                     },
                     {
                        name: '和歌山県',
                        data: [
                           ['pc=30', 'hc=1', '和歌山県', '紀伊勝浦'],
                           ['pc=30', 'hc=2', '和歌山県', '浦神'],
                           ['pc=30', 'hc=3', '和歌山県', '串本'],
                           ['pc=30', 'hc=4', '和歌山県', '周参見'],
                           ['pc=30', 'hc=5', '和歌山県', '田辺（旧）'],
                           ['pc=30', 'hc=6', '和歌山県', '三尾'],
                           ['pc=30', 'hc=7', '和歌山県', '比井湾'],
                           ['pc=30', 'hc=8', '和歌山県', '由良'],
                           ['pc=30', 'hc=9', '和歌山県', '下津'],
                           ['pc=30', 'hc=10', '和歌山県', '海南'],
                           ['pc=30', 'hc=11', '和歌山県', '和歌山'],
                           ['pc=30', 'hc=12', '和歌山県', '沖ノ島'],
                           ['pc=30', 'hc=13', '和歌山県', '田辺'],
                        ]
                     },
                     {
                        name: '鳥取県',
                        data: [
                           ['pc=31', 'hc=1', '鳥取県', '米子'],
                           ['pc=31', 'hc=2', '鳥取県', '境'],
                           ['pc=31', 'hc=3', '鳥取県', '淀江'],
                           ['pc=31', 'hc=4', '鳥取県', '赤碕'],
                           ['pc=31', 'hc=5', '鳥取県', '因幡網代'],
                           ['pc=31', 'hc=6', '鳥取県', '田後'],
                        ]
                     },
                     {
                        name: '島根県',
                        data: [
                           ['pc=32', 'hc=1', '島根県', '外ノ浦'],
                           ['pc=32', 'hc=2', '島根県', '江津'],
                           ['pc=32', 'hc=3', '島根県', '温泉津'],
                           ['pc=32', 'hc=4', '島根県', '大社'],
                           ['pc=32', 'hc=5', '島根県', '鷺'],
                           ['pc=32', 'hc=6', '島根県', '河下'],
                           ['pc=32', 'hc=7', '島根県', '恵曇'],
                           ['pc=32', 'hc=8', '島根県', '加賀'],
                           ['pc=32', 'hc=9', '島根県', '七類'],
                           ['pc=32', 'hc=10', '島根県', '大根島'],
                           ['pc=32', 'hc=11', '島根県', '安来'],
                           ['pc=32', 'hc=12', '島根県', '浦郷'],
                           ['pc=32', 'hc=13', '島根県', '日ノ津浦'],
                           ['pc=32', 'hc=14', '島根県', '菱浦'],
                           ['pc=32', 'hc=15', '島根県', '知々井'],
                           ['pc=32', 'hc=16', '島根県', '西郷'],
                           ['pc=32', 'hc=17', '島根県', '松江'],
                        ]
                     },
            ],
            choicePorts: [],
            choicePort: '',
            choicePc:'',
         }
   },

   computed:{
      // テンプレートで使う現在時刻を代入
      yearMonth:function(){
         this.year = date.getFullYear();
         this.month = date.getMonth() + 1;
         this.actualDay = date.getDate();
         let yearMonth = this.year + '年' +  this.month + '月';
         return yearMonth;
      },
   },

   methods: {
      //都道府県選択からの港表示まで
      pcName:function(prefecture, index){
         // numが0の時は選択した都道府県の港を返し、港を表示する
         if(num == 0){
            for(let i = 0; i < this.hcNames[index].data.length; i++){
               this.choicePorts.push(this.hcNames[index].data[i][3]);
            }
            num++;
            this.isShow = true;
            this.index = index;
            this.choicePc = prefecture;
            return this.choicePorts, this.choicePc, num, index;
         } else {
            // numが1以上の場合は選択した都道府県のデータを削除し、港を非表示にする
            num = 0;
            this.choicePort = '';
            this.choicePorts.splice(0, this.choicePorts.length);
            this.isShow = false;
            return this.choicePorts, this.choicePort, num;
         }
      },

      //PCとHCのparameterを代入
      pchcParames:function(portName, index2){
            pc = this.hcNames[this.index].data[index2][0];  // 都道府県番号
            hc = this.hcNames[this.index].data[index2][1]; // 港番号
            this.choicePort = portName;
            return pc, hc, this.choicePort;
      },

      // パラメータに現在日時を入力してAPI取得
      async asyncData() {
         this.year = date.getFullYear();
         this.month = date.getMonth() + 1;
         this.actualDay = date.getDate();
         yr = 'yr=' + this.year;
         mn = 'mn=' + this.month;
         dy = 'dy=' + this.actualDay;
         let items = await this.$axios.$get('/api/' + '?' + pc + '&' + hc + '&'+ yr + '&' + mn + '&' + dy + '&' + rg);
         console.log(items);
         tideDatas = items;
         return {
            tideDatas,
         }
      },
   },

   

   

   mounted() {

   },
   
}
</script>

<style>

</style>

// https://zenn.dev/mouse_484/artizcles/nuxt-axios-cors

// https://zenn.dev/code_diver/articles/dcf0ec9803cb55

